{
    "status": "ok",
    "totalResults": 8798,
    "articles": [
    {
    "source": {
    "id": null,
    "name": "Freerepublic.com"
    },
    "author": "wnd.com",
    "title": "The Big List of U.S. companies going crazy woke for LGBT\n'A corporate shakedown strategy that would make Jesse Jackson green with envy(long)",
    "description": "The transformation of once-wholesome American corporations like Disney and Walmart into fulcrums of LGBT power, advancing a wildly destructive sex-and-gender revolution, is not just a tragic story of American moral decline, but also one that offers vital and …",
    "url": "https://freerepublic.com/focus/f-news/4138068/posts",
    "urlToImage": null,
    "publishedAt": "2023-03-14T14:46:06Z",
    "content": "Skip to comments.\r\nThe Big List of U.S. companies going crazy woke for LGBT\r\n'A corporate shakedown strategy that would make Jesse Jackson green with envy(long)wnd.com ^\r\n | 3/13/2023 1930 hrs edst\r\n… [+4974 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "Freerepublic.com"
    },
    "author": "New Republic",
    "title": "Silicon Valley’s Titans Are Realizing a Lot of People Really Don’t Like Them; A bank run led to a wake-up call for America’s most coddled class of plutocrats. (a surprisingly decent read from New Republic)",
    "description": "The Treasury, the Federal Reserve, and the Federal Deposit Insurance Corporation announced on Sunday that they will guarantee all deposits that were still held at the ill-fated Silicon Valley Bank when it collapsed last Friday. This is probably a good thing. …",
    "url": "https://freerepublic.com/focus/f-news/4138067/posts",
    "urlToImage": null,
    "publishedAt": "2023-03-14T14:44:25Z",
    "content": "Skip to comments.\r\nSilicon Valleys Titans Are Realizing a Lot of People Really Dont Like Them; A bank run led to a wake-up call for Americas most coddled class of plutocrats. (a surprisingly decent r… [+12933 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "Globalresearch.ca"
    },
    "author": "General Emil Strainu",
    "title": "Geoengineering: Romanian General Emil Strainu on the Terrifying Possibilities of Geo-warfare",
    "description": "All Global Research articles can be read in 51 languages by activating the Translate Website button below the author’s name (desktop version) To receive Global Research’s Daily Newsletter (selected articles), click here. Follow us on Instagram and Twitter and…",
    "url": "https://www.globalresearch.ca/romanian-general-emil-strainu-terrifying-possibilities-geo-warfare/5811760",
    "urlToImage": "https://www.globalresearch.ca/wp-content/uploads/2023/03/Strainu.jpg",
    "publishedAt": "2023-03-14T14:41:15Z",
    "content": "All Global Research articles can be read in 51 languages by activating the Translate Website button below the authors name (desktop version)\r\nTo receive Global Researchs Daily Newsletter (selected ar… [+10033 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "Autoblog"
    },
    "author": "Byron Hurd",
    "title": "Nissan Ariya EVs recalled to secure steering wheels that could come off",
    "description": "Filed under:\n Recalls,Nissan,Safety,Crossover,Electric\n Continue reading Nissan Ariya EVs recalled to secure steering wheels that could come off\nNissan Ariya EVs recalled to secure steering wheels that could come off originally appeared on Autoblog on Tue, 14…",
    "url": "https://www.autoblog.com/2023/03/14/nissan-ariya-steering-wheel-recall/",
    "urlToImage": "https://o.aolcdn.com/images/dims3/GLOB/legacy_thumbnail/1062x597/format/jpg/quality/100/https://s.aolcdn.com/os/ab/_cms/2022/10/14112759/2023-Nissan-Ariya-18.jpg",
    "publishedAt": "2023-03-14T14:40:00Z",
    "content": "Nissan is recalling 1,063 examples of its new Ariya EV to address an issue that may lead to the steering wheel coming off in the driver's hands a prospect that also has led to a federal investigation… [+1581 chars]"
    }
]
}
